Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54P19A.PIC
      <edc:SFRDef edc:_addr="0x4200042C" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="TOCV" edc:impl="0xFFFF" edc:mclr="00000000000000001111111111111111" edc:nzwidth="0x20" edc:por="00000000000000001111111111111111" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TOC" edc:desc="Timeout Counter" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x42000430" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0x42000440" edc:access="--------rrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="ECR" edc:impl="0xFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TEC" edc:desc="Transmit Error Counter" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="REC" edc:desc="Receive Error Counter" edc:nzwidth="0x7"/>
            <edc:SFRFieldDef edc:cname="RP" edc:desc="Receive Error Passive" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CEL" edc:desc="CAN Error Logging" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000444" edc:access="---------rrrrrrr-rrrrrrrrrrrrrrr" edc:cname="PSR" edc:impl="0x7F7FFF" edc:mclr="00000000000000000000011100000111" edc:nzwidth="0x20" edc:por="00000000000000000000011100000111" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="LEC" edc:desc="Last Error Code" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="STUFF" edc:desc="Stuff Error" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FORM" edc:desc="Form Error" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="Ack Error" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="BIT1" edc:desc="Bit1 Error" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="BIT0" edc:desc="Bit0 Error" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CRC" edc:desc="CRC Error" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="NC" edc:desc="No Change" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="ACT" edc:desc="Activity" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="SYNC" edc:desc="Node is synchronizing on CAN communication" edc:when="(field &amp; 0x3) == 0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE" edc:desc="Node is neither receiver nor transmitter" edc:when="(field &amp; 0x3) == 1"/>
              <edc:SFRFieldSemantic edc:cname="RX" edc:desc="Node is operating as receiver" edc:when="(field &amp; 0x3) == 2"/>
              <edc:SFRFieldSemantic edc:cname="TX" edc:desc="Node is operating as transmitter" edc:when="(field &amp; 0x3) == 3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="EP" edc:desc="Error Passive" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EW" edc:desc="Warning Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BO" edc:desc="Bus_Off Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DLEC" edc:desc="Data Phase Last Error Code" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Error" edc:when="(field &amp; 0x7) == 0"/>
              <edc:SFRFieldSemantic edc:cname="STUFF" edc:desc="Stuff Error" edc:when="(field &amp; 0x7) == 1"/>
              <edc:SFRFieldSemantic edc:cname="FORM" edc:desc="Form Error" edc:when="(field &amp; 0x7) == 2"/>
              <edc:SFRFieldSemantic edc:cname="ACK" edc:desc="Ack Error" edc:when="(field &amp; 0x7) == 3"/>
              <edc:SFRFieldSemantic edc:cname="BIT1" edc:desc="Bit1 Error" edc:when="(field &amp; 0x7) == 4"/>
              <edc:SFRFieldSemantic edc:cname="BIT0" edc:desc="Bit0 Error" edc:when="(field &amp; 0x7) == 5"/>
              <edc:SFRFieldSemantic edc:cname="CRC" edc:desc="CRC Error" edc:when="(field &amp; 0x7) == 6"/>
              <edc:SFRFieldSemantic edc:cname="NC" edc:desc="No Change" edc:when="(field &amp; 0x7) == 7"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="RESI" edc:desc="ESI flag of last received CAN FD Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RBRS" edc:desc="BRS flag of last received CAN FD Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RFDF" edc:desc="Received a CAN FD Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PXE" edc:desc="Protocol Exception Event" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCV" edc:desc="Transmitter Delay Compensation Value" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000448" edc:access="-----------------nnnnnnn-nnnnnnn" edc:cname="TDCR" edc:impl="0x7F7F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="TDCF" edc:desc="Transmitter Delay Compensation Filter Length" edc:nzwidth="0x7"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="TDCO" edc:desc="Transmitter Delay Compensation Offset" edc:nzwidth="0x7"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x4200044C" edc:offset="0x4"/>
      <edc:SFRDef edc:_addr="0x42000450" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IR" edc:impl="0x3FFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="RF0N" edc:desc="Rx FIFO 0 New Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0W" edc:desc="Rx FIFO 0 Watermark Reached" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0F" edc:desc="Rx FIFO 0 Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0L" edc:desc="Rx FIFO 0 Message Lost" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1N" edc:desc="Rx FIFO 1 New Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1W" edc:desc="Rx FIFO 1 Watermark Reached" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1F" edc:desc="Rx FIFO 1 FIFO Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1L" edc:desc="Rx FIFO 1 Message Lost" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPM" edc:desc="High Priority Message" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TC" edc:desc="Timestamp Completed" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCF" edc:desc="Transmission Cancellation Finished" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFE" edc:desc="Tx FIFO Empty" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFN" edc:desc="Tx Event FIFO New Entry" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFW" edc:desc="Tx Event FIFO Watermark Reached" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFF" edc:desc="Tx Event FIFO Full" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFL" edc:desc="Tx Event FIFO Element Lost" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSW" edc:desc="Timestamp Wraparound" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAF" edc:desc="Message RAM Access Failure" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOO" edc:desc="Timeout Occurred" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRX" edc:desc="Message stored to Dedicated Rx Buffer" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BEC" edc:desc="Bit Error Corrected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BEU" edc:desc="Bit Error Uncorrected" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ELO" edc:desc="Error Logging Overflow" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EP" edc:desc="Error Passive" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EW" edc:desc="Warning Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BO" edc:desc="Bus_Off Status" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDI" edc:desc="Watchdog Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEA" edc:desc="Protocol Error in Arbitration Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PED" edc:desc="Protocol Error in Data Phase" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARA" edc:desc="Access to Reserved Address" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000454" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="IE" edc:impl="0x3FFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="RF0NE" edc:desc="Rx FIFO 0 New Message Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0WE" edc:desc="Rx FIFO 0 Watermark Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0FE" edc:desc="Rx FIFO 0 Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0LE" edc:desc="Rx FIFO 0 Message Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1NE" edc:desc="Rx FIFO 1 New Message Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1WE" edc:desc="Rx FIFO 1 Watermark Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1FE" edc:desc="Rx FIFO 1 FIFO Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1LE" edc:desc="Rx FIFO 1 Message Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPME" edc:desc="High Priority Message Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCE" edc:desc="Timestamp Completed Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCFE" edc:desc="Transmission Cancellation Finished Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFEE" edc:desc="Tx FIFO Empty Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFNE" edc:desc="Tx Event FIFO New Entry Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFWE" edc:desc="Tx Event FIFO Watermark Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFE" edc:desc="Tx Event FIFO Full Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFLE" edc:desc="Tx Event FIFO Element Lost Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSWE" edc:desc="Timestamp Wraparound Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAFE" edc:desc="Message RAM Access Failure Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOOE" edc:desc="Timeout Occurred Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRXE" edc:desc="Message stored to Dedicated Rx Buffer Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BECE" edc:desc="Bit Error Corrected Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BEUE" edc:desc="Bit Error Uncorrected Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ELOE" edc:desc="Error Logging Overflow Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPE" edc:desc="Error Passive Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWE" edc:desc="Warning Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOE" edc:desc="Bus_Off Status Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDIE" edc:desc="Watchdog Interrupt Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEAE" edc:desc="Protocol Error in Arbitration Phase Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEDE" edc:desc="Protocol Error in Data Phase Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARAE" edc:desc="Access to Reserved Address Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x42000458" edc:access="--nnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ILS" edc:impl="0x3FFFFFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="CAN1">
            <edc:SFRFieldDef edc:cname="RF0NL" edc:desc="Rx FIFO 0 New Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0WL" edc:desc="Rx FIFO 0 Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0FL" edc:desc="Rx FIFO 0 Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF0LL" edc:desc="Rx FIFO 0 Message Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1NL" edc:desc="Rx FIFO 1 New Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1WL" edc:desc="Rx FIFO 1 Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1FL" edc:desc="Rx FIFO 1 FIFO Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RF1LL" edc:desc="Rx FIFO 1 Message Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HPML" edc:desc="High Priority Message Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCL" edc:desc="Timestamp Completed Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TCFL" edc:desc="Transmission Cancellation Finished Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TFEL" edc:desc="Tx FIFO Empty Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFNL" edc:desc="Tx Event FIFO New Entry Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFWL" edc:desc="Tx Event FIFO Watermark Reached Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFFL" edc:desc="Tx Event FIFO Full Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TEFLL" edc:desc="Tx Event FIFO Element Lost Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TSWL" edc:desc="Timestamp Wraparound Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MRAFL" edc:desc="Message RAM Access Failure Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TOOL" edc:desc="Timeout Occurred Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DRXL" edc:desc="Message stored to Dedicated Rx Buffer Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BECL" edc:desc="Bit Error Corrected Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BEUL" edc:desc="Bit Error Uncorrected Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ELOL" edc:desc="Error Logging Overflow Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EPL" edc:desc="Error Passive Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EWL" edc:desc="Warning Status Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="BOL" edc:desc="Bus_Off Status Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WDIL" edc:desc="Watchdog Interrupt Interrupt Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEAL" edc:desc="Protocol Error in Arbitration Phase Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PEDL" edc:desc="Protocol Error in Data Phase Line" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ARAL" edc:desc="Access to Reserved Address Line" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
