Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54P19A.PIC
      <edc:SFRDef edc:_addr="0x43002014" edc:access="------nn" edc:cname="SWTRIG" edc:impl="0x3" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="FLUSH" edc:desc="ADC Conversion Flush" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="START" edc:desc="Start ADC Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43002015" edc:offset="0x17"/>
      <edc:SFRDef edc:_addr="0x4300202C" edc:access="-----nnn" edc:cname="INTENCLR" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:desc="Result Ready Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:desc="Overrun Interrupt Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:desc="Window Monitor Interrupt Disable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300202D" edc:access="-----nnn" edc:cname="INTENSET" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:desc="Result Ready Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:desc="Overrun Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:desc="Window Monitor Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300202E" edc:access="-----nnn" edc:cname="INTFLAG" edc:impl="0x7" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="RESRDY" edc:desc="Result Ready Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVERRUN" edc:desc="Overrun Interrupt Flag" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINMON" edc:desc="Window Monitor Interrupt Flag" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300202F" edc:access="rrrrrr-r" edc:cname="STATUS" edc:impl="0xFD" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="ADCBUSY" edc:desc="ADC Busy Status" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WCC" edc:desc="Window Comparator Counter" edc:nzwidth="0x6"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002030" edc:access="--------------------rrrrrrrrrrrr" edc:cname="SYNCBUSY" edc:impl="0xFFF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="SWRST Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="ENABLE Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:desc="Input Control Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="Control B Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFCTRL" edc:desc="Reference Control Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:desc="Average Control Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:desc="Sampling Time Control Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="Window Monitor Lower Threshold Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="Window Monitor Upper Threshold Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction Synchronization Busy" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SWTRIG" edc:desc="Software Trigger Synchronization Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002034" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="DSEQDATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="DMA Sequential Data" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002038" edc:access="n----------------------nnnnnnnnn" edc:cname="DSEQCTRL" edc:impl="0x800001FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:desc="Input Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="Control B" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFCTRL" edc:desc="Reference Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:desc="Average Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:desc="Sampling Time Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="Window Monitor Lower Threshold" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="Window Monitor Upper Threshold" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="AUTOSTART" edc:desc="ADC Auto-Start Conversion" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4300203C" edc:access="r----------------------rrrrrrrrr" edc:cname="DSEQSTAT" edc:impl="0x800001FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="INPUTCTRL" edc:desc="Input Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTRLB" edc:desc="Control B" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="REFCTRL" edc:desc="Reference Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AVGCTRL" edc:desc="Average Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SAMPCTRL" edc:desc="Sampling Time Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINLT" edc:desc="Window Monitor Lower Threshold" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WINUT" edc:desc="Window Monitor Upper Threshold" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="GAINCORR" edc:desc="Gain Correction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OFFSETCORR" edc:desc="Offset Correction" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x16"/>
            <edc:SFRFieldDef edc:cname="BUSY" edc:desc="DMA Sequencing Busy" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x43002040" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RESULT" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="RESULT" edc:desc="Result Conversion Value" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43002042" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x43002044" edc:access="rrrrrrrrrrrrrrrr" edc:cname="RESS" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="RESS" edc:desc="Last ADC conversion result" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x43002046" edc:offset="0x2"/>
      <edc:SFRDef edc:_addr="0x43002048" edc:access="-----nnn-nnn-nnn" edc:cname="CALIB" edc:impl="0x777" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="ADC1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ADC1">
            <edc:SFRFieldDef edc:cname="BIASCOMP" edc:desc="Bias Comparator Scaling" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BIASR2R" edc:desc="Bias R2R Ampli scaling" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="BIASREFBUF" edc:desc="Bias  Reference Buffer Scaling" edc:nzwidth="0x3"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
