Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54P19A.PIC
      <edc:SFRDef edc:_addr="0xE0000EFC" edc:access="-------------------------------r" edc:cname="IRR" edc:impl="0x1" edc:nzwidth="0x20" ltx:memberofperipheral="ITM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ITM">
            <edc:SFRFieldDef edc:cname="ATREADYM" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0xE0000F00" edc:offset="0x100"/>
      <edc:SFRDef edc:_addr="0xE0001000" edc:access="nnnnnnnn-nnnnnnn---nnnnnnnnnnnnn" edc:cname="CTRL" edc:impl="0xFF7F1FFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CYCCNTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="POSTPRESET" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="POSTINIT" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="CYCTAP" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SYNCTAP" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="PCSAMPLENA" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="EXCTRCENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CPIEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EXCEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SLEEPEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LSUEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FOLDEVTENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCEVTENA" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="NOPRFCNT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOCYCCNT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOEXTTRIG" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NOTRCPKT" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="NUMCOMP" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001004" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CYCCNT" edc:nzwidth="0x20" ltx:memberofperipheral="DWT"/>
      <edc:SFRDef edc:_addr="0xE0001008" edc:access="------------------------nnnnnnnn" edc:cname="CPICNT" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="CPICNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000100C" edc:access="------------------------nnnnnnnn" edc:cname="EXCCNT" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="EXCCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001010" edc:access="------------------------nnnnnnnn" edc:cname="SLEEPCNT" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="SLEEPCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001014" edc:access="------------------------nnnnnnnn" edc:cname="LSUCNT" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="LSUCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001018" edc:access="------------------------nnnnnnnn" edc:cname="FOLDCNT" edc:impl="0xFF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FOLDCNT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE000101C" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PCSR" edc:nzwidth="0x20" ltx:memberofperipheral="DWT"/>
      <edc:SFRDef edc:_addr="0xE0001020" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="COMP0" edc:nzwidth="0x20" ltx:memberofperipheral="DWT"/>
      <edc:SFRDef edc:_addr="0xE0001024" edc:access="---------------------------nnnnn" edc:cname="MASK0" edc:impl="0x1F" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="MASK" edc:nzwidth="0x5"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0001028" edc:access="-------n----nnnnnnnnnnnnn-n-nnnn" edc:cname="FUNCTION0" edc:impl="0x10FFFAF" edc:nzwidth="0x20" ltx:memberofperipheral="DWT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="DWT">
            <edc:SFRFieldDef edc:cname="FUNCTION" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="EMITRANGE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="CYCMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVMATCH" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LNK1ENA" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DATAVSIZE" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR0" edc:nzwidth="0x4"/>
            <edc:SFRFieldDef edc:cname="DATAVADDR1" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MATCHED" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
