Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54P19A.PIC
      <edc:AdjustPoint edc:_addr="0xE0041F04" edc:offset="0x9C"/>
      <edc:SFRDef edc:_addr="0xE0041FA0" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMSET" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FA4" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CLAIMCLR" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041FA8" edc:offset="0x8"/>
      <edc:SFRDef edc:_addr="0xE0041FB0" edc:access="wwwwwwwwwwwwwwwwwwwwwwwwwwwwwwww" edc:cname="LAR" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FB4" edc:access="-----------------------------rrr" edc:cname="LSR" edc:impl="0x7" edc:nzwidth="0x20" ltx:memberofperipheral="ETM">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="ETM">
            <edc:SFRFieldDef edc:cname="Present" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="Access" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ByteAcc" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0xE0041FB8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="AUTHSTATUS" edc:nzwidth="0x20" ltx:memberofperipheral="ETM"/>
      <edc:AdjustPoint edc:_addr="0xE0041FBC" edc:offset="0x10"/>
      <edc:SFRDef edc:_addr="0xE0041FCC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="DEVTYPE" edc:mclr="00000000000000000000000000010011" edc:nzwidth="0x20" edc:por="00000000000000000000000000010011" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FD0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR4" edc:mclr="00000000000000000000000000000100" edc:nzwidth="0x20" edc:por="00000000000000000000000000000100" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FD4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR5" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FD8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR6" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FDC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR7" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FE0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR0" edc:mclr="00000000000000000000000000100101" edc:nzwidth="0x20" edc:por="00000000000000000000000000100101" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FE4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR1" edc:mclr="00000000000000000000000010111001" edc:nzwidth="0x20" edc:por="00000000000000000000000010111001" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FE8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR2" edc:mclr="00000000000000000000000000001011" edc:nzwidth="0x20" edc:por="00000000000000000000000000001011" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FEC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="PIDR3" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FF0" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CIDR0" edc:mclr="00000000000000000000000000001101" edc:nzwidth="0x20" edc:por="00000000000000000000000000001101" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FF4" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CIDR1" edc:mclr="00000000000000000000000010010000" edc:nzwidth="0x20" edc:por="00000000000000000000000010010000" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FF8" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CIDR2" edc:mclr="00000000000000000000000000000101" edc:nzwidth="0x20" edc:por="00000000000000000000000000000101" ltx:memberofperipheral="ETM"/>
      <edc:SFRDef edc:_addr="0xE0041FFC" edc:access="rrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr" edc:cname="CIDR3" edc:mclr="00000000000000000000000010110001" edc:nzwidth="0x20" edc:por="00000000000000000000000010110001" ltx:memberofperipheral="ETM"/>
    </edc:SFRDataSector>
    <edc:SFRDataSector edc:beginaddr="0xE000E000" edc:endaddr="0xE000F000" edc:regionid="SCS"/>
    <edc:DeviceIDSector edc:beginaddr="0x41002018" edc:endaddr="0x4100201C" edc:mask="0xFFFFF0FF" edc:regionid="devid" edc:value="0x61840301"/>
    <edc:RegisterMap edc:id="SERCOM7/SPIS">
      <edc:SFRDef edc:access="-nnnnnnn--nn--nn-------nn--nnnnn" edc:addr="0x43000C00" edc:cname="CTRLA" edc:impl="0x7F33019F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="SWRST" edc:desc="Software Reset" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE" edc:desc="Operating Mode" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="USART_EXT_CLK" edc:desc="USART with external clock" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="USART_INT_CLK" edc:desc="USART with internal clock" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI in slave operation" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI in master operation" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="I2C_SLAVE" edc:desc="I2C slave operation" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="I2C_MASTER" edc:desc="I2C master operation" edc:when="(field &amp; 0x7) == 0x5"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run during Standby" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="IBON" edc:desc="Immediate Buffer Overflow Notification" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x7"/>
            <edc:SFRFieldDef edc:cname="DOPO" edc:desc="Data Out Pinout" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PAD0" edc:desc="DO on PAD[0], SCK on PAD[1] and SS on PAD[2]" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PAD2" edc:desc="DO on PAD[3], SCK on PAD[1] and SS on PAD[2]" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="DIPO" edc:desc="Data In Pinout" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="PAD0" edc:desc="SERCOM PAD[0] is used as data input" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="PAD1" edc:desc="SERCOM PAD[1] is used as data input" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PAD2" edc:desc="SERCOM PAD[2] is used as data input" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="PAD3" edc:desc="SERCOM PAD[3] is used as data input" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="FORM" edc:desc="Frame Format" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="SPI_FRAME" edc:desc="SPI Frame" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="SPI_FRAME_WITH_ADDR" edc:desc="SPI Frame with Addr" edc:when="(field &amp; 0xF) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPHA" edc:desc="Clock Phase" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="LEADING_EDGE" edc:desc="The data is sampled on a leading SCK edge and changed on a trailing SCK edge" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="TRAILING_EDGE" edc:desc="The data is sampled on a trailing SCK edge and changed on a leading SCK edge" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CPOL" edc:desc="Clock Polarity" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="IDLE_LOW" edc:desc="SCK is low when idle" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="IDLE_HIGH" edc:desc="SCK is high when idle" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="DORD" edc:desc="Data Order" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="MSB" edc:desc="MSB is transferred first" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="LSB" edc:desc="LSB is transferred first" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------nnnnnnnnn" edc:addr="0x43000C22" edc:cname="LENGTH" edc:impl="0x1FF" edc:mclr="0000000000000000" edc:nzwidth="0x10" edc:por="0000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="LEN" edc:desc="Data Length" edc:nzwidth="0x8"/>
            <edc:SFRFieldDef edc:cname="LENEN" edc:desc="Data Length Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------------n-nnn---n--n---nnn" edc:addr="0x43000C04" edc:cname="CTRLB" edc:impl="0x2E247" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="CHSIZE" edc:desc="Character Size" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="8_BIT" edc:desc="8 bits" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="9_BIT" edc:desc="9 bits" edc:when="(field &amp; 0x7) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="PLOADEN" edc:desc="Data Preload Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="SSDE" edc:desc="Slave Select Low Detect Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="MSSEN" edc:desc="Master Slave Select Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AMODE" edc:desc="Address Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MASK" edc:desc="SPI Address mask " edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="2_ADDRESSES" edc:desc="Two unique Addressess" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="RANGE" edc:desc="Address Range" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="--------nnnnnnnn--------nnnnnnnn" edc:addr="0x43000C24" edc:cname="ADDR" edc:impl="0xFF00FF" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="ADDR" edc:desc="Address Value" edc:nzwidth="0x8"/>
            <edc:AdjustPoint edc:offset="0x8"/>
            <edc:SFRFieldDef edc:cname="ADDRMASK" edc:desc="Address Mask" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n------------------nnnnnn" edc:addr="0x43000C08" edc:cname="CTRLC" edc:impl="0x100003F" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="ICSPACE" edc:desc="Inter-Character Spacing" edc:nzwidth="0x6"/>
            <edc:AdjustPoint edc:offset="0x12"/>
            <edc:SFRFieldDef edc:cname="DATA32B" edc:desc="Data 32 Bit" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="DATA_TRANS_8BIT" edc:desc="Transaction from and to DATA register are 8-bit" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DATA_TRANS_32BIT" edc:desc="Transaction from and to DATA register are 32-bit" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:addr="0x43000C28" edc:cname="DATA" edc:mclr="00000000000000000000000000000000" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" ltx:memberofperipheral="SERCOM7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="SERCOM7">
            <edc:SFRFieldDef edc:cname="DATA" edc:desc="Data Value" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
