Duet3D/RepRapFirmware/src/atmel/SAME54_DFP/1.1.134/edc/ATSAME54P19A.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PA08" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NMI" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y6" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA0" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDCMD" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="MCK0" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IN3" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="AIN10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="X8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA2" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDDAT1" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN5" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDDAT3" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="SDI" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO4" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN11" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X26" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y26" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="TX" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="SDCD" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="SCK1" edc:ppsfunction="J"/>
      <edc:VirtualPin edc:name="IO6" edc:ppsfunction="M"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X28" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y28" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="TX" edc:ppsfunction="H"/>
      <edc:VirtualPin edc:name="DATA8" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="L"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN9" edc:ppsfunction="N"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD08" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="F"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO5" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="L"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA10" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="L"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA12" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GRX3" edc:ppsfunction="L"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO6" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="SDCD" edc:ppsfunction="I"/>
      <edc:VirtualPin edc:name="DEN1" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GRX1" edc:ppsfunction="L"/>
      <edc:VirtualPin edc:name="CMP0" edc:ppsfunction="M"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT14" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD2" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO2" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="CLK" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GTXCK" edc:ppsfunction="L"/>
      <edc:VirtualPin edc:name="IO0" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="XIN0" edc:ppsfunction="XIN0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT15" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD3" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO1" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO3" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="GRXER" edc:ppsfunction="L"/>
      <edc:VirtualPin edc:name="IO1" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="XOUT0" edc:ppsfunction="XOUT0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="EXTINT0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="X10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="Y10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PAD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PAD1" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="E"/>
      <edc:VirtualPin edc:name="WO0" edc:ppsfunction="F"/>
      <edc:VirtualPin edc:name="WO4" edc:ppsfunction="G"/>
      <edc:VirtualPin edc:name="DATA0" edc:ppsfunction="K"/>
      <edc:VirtualPin edc:name="GCRS" edc:ppsfunction="L"/>
      <edc:VirtualPin edc:name="IO2" edc:ppsfunction="M"/>
      <edc:VirtualPin edc:name="IN0" edc:ppsfunction="N"/>
    </edc:Pin>
  </edc:PinList>
</edc:PIC>
